{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "top" : "sequential_6\/batch_normalization_6\/batchnorm\/mul",
      "w" : 40,
      "h" : 1,
      "name" : "sequential_6\/batch_normalization_6\/batchnorm\/mul",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "sequential_6\/batch_normalization_6\/batchnorm\/mul",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 1
    },
    {
      "bottom" : "batch_normalization_6_input,sequential_6\/batch_normalization_6\/batchnorm\/mul",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential_6\/batch_normalization_6\/batchnorm\/mul_1",
      "nd_mode" : true,
      "top" : "sequential_6\/batch_normalization_6\/batchnorm\/mul_1",
      "type" : "elementwise",
      "name" : "sequential_6\/batch_normalization_6\/batchnorm\/mul_1",
      "beta" : 0
    },
    {
      "top" : "sequential_6\/batch_normalization_6\/batchnorm\/sub",
      "w" : 40,
      "h" : 1,
      "name" : "sequential_6\/batch_normalization_6\/batchnorm\/sub",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "sequential_6\/batch_normalization_6\/batchnorm\/sub",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 3
    },
    {
      "bottom" : "sequential_6\/batch_normalization_6\/batchnorm\/mul_1,sequential_6\/batch_normalization_6\/batchnorm\/sub",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential_6\/batch_normalization_6\/batchnorm\/add_1",
      "nd_mode" : true,
      "top" : "sequential_6\/batch_normalization_6\/batchnorm\/add_1",
      "type" : "elementwise",
      "name" : "sequential_6\/batch_normalization_6\/batchnorm\/add_1",
      "beta" : 0
    },
    {
      "nB" : 40,
      "top" : "sequential_6\/dense_15\/Relu",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 16,
      "blob_weights" : 7,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "sequential_6\/batch_normalization_6\/batchnorm\/add_1",
      "blob_biases" : 5,
      "has_tanh" : 0,
      "debug_info" : "sequential_6\/dense_15\/BiasAdd",
      "name" : "sequential_6\/dense_15\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "nB" : 16,
      "top" : "sequential_6\/dense_16\/BiasAdd",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 1,
      "blob_weights" : 11,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "sequential_6\/dense_15\/Relu",
      "blob_biases" : 9,
      "has_tanh" : 0,
      "debug_info" : "sequential_6\/dense_16\/BiasAdd",
      "name" : "sequential_6\/dense_16\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "bottom" : "sequential_6\/dense_16\/BiasAdd",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "sequential_6\/dense_16\/Sigmoid",
      "top" : "Identity",
      "type" : "activation",
      "name" : "sequential_6\/dense_16\/Sigmoid",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}